; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-13)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 )
(:init
(ontable b1)
(on b2 b8)
(ontable b3)
(on b4 b9)
(on b5 b12)
(ontable b6)
(on b7 b1)
(on b8 b10)
(on b9 b6)
(ontable b10)
(on b11 b5)
(ontable b12)
(on b13 b7)
(clear b2)
(clear b3)
(clear b4)
(clear b11)
(clear b13)
)
(:goal
(and
(on b1 b5)
(on b2 b13)
(on b3 b11)
(on b6 b8)
(on b7 b4)
(on b8 b2)
(on b9 b1)
(on b10 b12)
(on b11 b6)
(on b12 b3)
(on b13 b7))
)
)

; plan
1. (move-b-to-t b4 b9)
   deleted: (on b4 b9)
   added: (ontable b4) (clear b9)
   goals met: 1 of 11
2. (move-b-to-b b13 b7 b11)
   deleted: (clear b11) (on b13 b7)
   added: (on b13 b11) (clear b7)
   goals met: 0 of 11
3. (move-b-to-b b7 b1 b4)
   deleted: (clear b4) (on b7 b1)
   added: (on b7 b4) (clear b1)
   goals met: 1 of 11
4. (move-b-to-b b13 b11 b7)
   deleted: (clear b7) (on b13 b11)
   added: (on b13 b7) (clear b11)
   goals met: 2 of 11
5. (move-b-to-b b2 b8 b13)
   deleted: (clear b13) (on b2 b8)
   added: (on b2 b13) (clear b8)
   goals met: 3 of 11
6. (move-b-to-b b11 b5 b3)
   deleted: (clear b3) (on b11 b5)
   added: (on b11 b3) (clear b5)
   goals met: 3 of 11
7. (move-b-to-b b8 b10 b2)
   deleted: (clear b2) (on b8 b10)
   added: (on b8 b2) (clear b10)
   goals met: 4 of 11
8. (move-b-to-t b5 b12)
   deleted: (on b5 b12)
   added: (ontable b5) (clear b12)
   goals met: 4 of 11
9. (move-t-to-b b1 b5)
   deleted: (clear b5) (ontable b1)
   added: (on b1 b5)
   goals met: 5 of 11
10. (move-b-to-b b9 b6 b1)
   deleted: (clear b1) (on b9 b6)
   added: (on b9 b1) (clear b6)
   goals met: 6 of 11
11. (move-t-to-b b6 b8)
   deleted: (clear b8) (ontable b6)
   added: (on b6 b8)
   goals met: 7 of 11
12. (move-b-to-b b11 b3 b6)
   deleted: (clear b6) (on b11 b3)
   added: (on b11 b6) (clear b3)
   goals met: 8 of 11
13. (move-t-to-b b3 b11)
   deleted: (clear b11) (ontable b3)
   added: (on b3 b11)
   goals met: 9 of 11
14. (move-t-to-b b12 b3)
   deleted: (clear b3) (ontable b12)
   added: (on b12 b3)
   goals met: 10 of 11
15. (move-t-to-b b10 b12)
   deleted: (clear b12) (ontable b10)
   added: (on b10 b12)
   goals met: 11 of 11
